{"class_name": "Model", "keras_version": "2.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 56, 56, 1], "name": "Input_Layer", "sparse": false}, "inbound_nodes": [], "name": "Input_Layer"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5]}, "inbound_nodes": [[["Input_Layer", 0, 0, {}]]], "name": "conv1"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "drop1"}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "drop1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activate1"}, "inbound_nodes": [[["drop1", 0, 0, {}]]], "name": "activate1"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activate1", 0, 0, {}]]], "name": "maxpool1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool1", 0, 0, {}]]], "name": "conv2"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "drop2"}, "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "drop2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activate2"}, "inbound_nodes": [[["drop2", 0, 0, {}]]], "name": "activate2"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activate2", 0, 0, {}]]], "name": "maxpool2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool2", 0, 0, {}]]], "name": "conv3"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "drop3"}, "inbound_nodes": [[["conv3", 0, 0, {}]]], "name": "drop3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activate3"}, "inbound_nodes": [[["drop3", 0, 0, {}]]], "name": "activate3"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activate3", 0, 0, {}]]], "name": "maxpool3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool3", 0, 0, {}]]], "name": "conv4"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "drop4"}, "inbound_nodes": [[["conv4", 0, 0, {}]]], "name": "drop4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activate4"}, "inbound_nodes": [[["drop4", 0, 0, {}]]], "name": "activate4"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool4", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["activate4", 0, 0, {}]]], "name": "maxpool4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv5", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["maxpool4", 0, 0, {}]]], "name": "conv5"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "drop5"}, "inbound_nodes": [[["conv5", 0, 0, {}]]], "name": "drop5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activate5"}, "inbound_nodes": [[["drop5", 0, 0, {}]]], "name": "activate5"}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool5", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3]}, "inbound_nodes": [[["activate5", 0, 0, {}]]], "name": "maxpool5"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_to_dense"}, "inbound_nodes": [[["maxpool5", 0, 0, {}]]], "name": "flatten_to_dense"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_to_dense", 0, 0, {}]]], "name": "dense2"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "drop_dense2"}, "inbound_nodes": [[["dense2", 0, 0, {}]]], "name": "drop_dense2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 11, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["drop_dense2", 0, 0, {}]]], "name": "output"}], "input_layers": [["Input_Layer", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}